{
  "ap_calculus_ab": "AP Calculus AB is an introductory college-level calculus course. Students cultivate their understanding of differential and integral calculus through engaging with real-world problems represented graphically, numerically, analytically, and verbally and using definitions and theorems to build arguments and justify conclusions as they explore concepts like change, limits, and the analysis of functions.",
  "ap_calculus_bc": "AP Calculus BC is an introductory college-level calculus course. Students cultivate their understanding of differential and integral calculus through engaging with real-world problems represented graphically, numerically, analytically, and verbally and using definitions and theorems to build arguments and justify conclusions as they explore concepts like change, limits, and the analysis of functions.\n\n",
  "ap_statistics": "AP Statistics is an introductory college-level statistics course that introduces students to the major concepts and tools for collecting, analyzing, and drawing conclusions from data. Students cultivate their understanding of statistics using technology, investigations, problem solving, and writing as they explore concepts like variation and distribution; patterns and uncertainty; and data-based predictions, decisions, and conclusions.",
  "ap_biology": "AP Biology is an introductory college-level biology course. Students cultivate their understanding of biology through inquiry-based investigations as they explore topics like evolution, energetics, information storage and transfer, and system interactions.\n\n",
  "ap_chemistry": "AP Chemistry is an introductory college-level chemistry course. Students cultivate their understanding of chemistry through inquiry-based lab investigations as they explore the four Big Ideas: scale, proportion, and quantity; structure and properties of substances; transformations; and energy.\n\n",
  "ap_environmental_science": "Students cultivate their understanding of the interrelationships of the natural world through inquiry-based lab investigations and field work as they explore concepts like the four Big Ideas; energy transfer, interactions between earth systems, interactions between different species and the environment, and sustainability.\n\n",
  "ap_physics_1": "AP Physics 1 is an algebra-based, introductory college-level physics course. Students cultivate their understanding of physics through classroom study, in-class activity, and hands-on, inquiry-based laboratory work as they explore concepts like systems, fields, force interactions, change, conservation, and waves.\n\n",
  "ap_physics_2": "AP Physics 2 is an algebra-based, introductory college-level physics course. Students cultivate their understanding of physics through classroom study, in-class activity, and hands-on, inquiry-based laboratory work as they explore concepts like systems, fields, force interactions, change, conservation, waves, and probability.\n\n",
  "ap_physics_c_electro": "AP Physics C: Electricity and Magnetism is a one-semester, calculus-based, college-level physics course, especially appropriate for students planning to specialize or major in one of the physical sciences or engineering. Students cultivate their understanding of physics through classroom study and activities as well as hands-on laboratory work as they explore concepts like change, force interactions, fields, and conservation.",
  "ap_physics_c_mechanics": "AP Physics C: Mechanics is a one-semester, calculus-based, college-level physics course, especially appropriate for students planning to specialize or major in one of the physical sciences or engineering. Students cultivate their understanding of physics through classroom study and activities as well as hands-on laboratory work as they explore concepts like change, force interactions, fields, and conservation.\n\n",
  "ap_latin": "AP Latin is equivalent to an upper-intermediate level college course in Latin focusing on the in-depth study of selections from two of the greatest works in Latin literature: Vergil’s Aeneid and Caesar’s Gallic War. Students cultivate their understanding of classics through preparing and translating readings and considering themes in the context of ancient literature as they explore concepts like literary techniques, Roman values, war and empire, leadership, views of non-Romans, history and memory, and human beings and the gods.\n\n",
  "ap_german": "AP German Language and Culture is equivalent to an intermediate level college course in German. Students cultivate their understanding of German language and culture by applying interpersonal, interpretive, and presentational modes of communication in real-life situations as they explore concepts related to family and communities, personal and public identities, beauty and aesthetics, science and technology, contemporary life, and global challenges.\n\n",
  "ap_chinese": "AP Chinese Language and Culture is equivalent to an intermediate-level college course in Chinese. Students cultivate their understanding of Chinese language and culture by applying the interpersonal, interpretive, and presentational modes of communication in real-life situations as they explore concepts related to family and community, personal and public identity, beauty and aesthetics, science and technology, contemporary life, and global challenges.\n\n",
  "ap_italian": "AP Italian Language and Culture is equivalent to an intermediate level college course in Italian. Students cultivate their understanding of Italian language and culture by applying interpersonal, interpretive, and presentational modes of communication in real-life situations as they explore concepts related to family and community, personal and public identity, beauty and aesthetics, science and technology, contemporary life, and global challenges.\n\n",
  "ap_spanish_language": "AP Spanish Language and Culture is equivalent to an intermediate level college course in Spanish. Students cultivate their understanding of Spanish language and culture by applying interpersonal, interpretive, and presentational modes of communication in real-life situations as they explore concepts related to family and communities, personal and public identities, beauty and aesthetics, science and technology, contemporary life, and global challenges.\n\n",
  "ap_spanish_literature": "AP Spanish Literature is equivalent to a college level introductory survey course of literature written in Spanish. Students continue to develop their interpretive, interpersonal, and presentational skills in Spanish language as well as critical reading and analytical writing as they explore short stories, novels, plays, essays, and poetry from Spain, Latin America, and U.S. Hispanic authors along with other non-required texts.\n\n",
  "ap_french": "AP French Language and Culture is equivalent to an intermediate level college course in French. Students cultivate their understanding of French language and culture by applying interpersonal, interpretive, and presentational modes of communication in real-life situations as they explore concepts related to family and community, personal and public identity, beauty and aesthetics, science and technology, contemporary life, and global challenges.\n\n",
  "ap_japanese": "AP Japanese Language and Culture is equivalent to an intermediate-level college course in Japanese. Students cultivate their understanding of Japanese language and culture by applying interpersonal, interpretive, and presentational modes of communication in real-life situations as they explore concepts related to family and community, personal and public identity, beauty and aesthetics, science and technology, contemporary life, and global challenges.\n\n",
  "ap": "ap"




}